adafruit/seesaw/lib/samd21/samd21c/edc/ATSAMD21G15L.PIC
      <edc:AdjustPoint edc:_addr="0x4200241C" edc:offset="0x2"/>
      <edc:SFRDef edc:_addr="0x4200241E" edc:access="-----n-n" edc:cname="DBGCTRL" edc:impl="0x5" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC1">
            <edc:SFRFieldDef edc:cname="DBGRUN" edc:desc="Debug Running Mode" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FDDBD" edc:desc="Fault Detection on Debug Break Detection" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4200241F" edc:offset="0x1"/>
      <edc:SFRDef edc:_addr="0x42002420" edc:access="----nnnn----nnnnnnnn-nnnnnnnnnnn" edc:cname="EVCTRL" edc:impl="0xF0FF7FF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="TCC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC1">
            <edc:SFRFieldDef edc:cname="EVACT0" edc:desc="Timer/counter Input Event0 Action" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Event action disabled" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="RETRIGGER" edc:desc="Start, restart or re-trigger counter on event" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="COUNTEV" edc:desc="Count on event" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="START" edc:desc="Start counter on event" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="INC" edc:desc="Increment counter on event" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="COUNT" edc:desc="Count on active state of asynchronous event" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="STAMP" edc:desc="Stamp capture" edc:when="(field &amp; 0x7) == 6"/>
              <edc:SFRFieldSemantic edc:cname="FAULT" edc:desc="Non-recoverable fault" edc:when="(field &amp; 0x7) == 7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="EVACT1" edc:desc="Timer/counter Input Event1 Action" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Event action disabled" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="RETRIGGER" edc:desc="Re-trigger counter on event" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="DIR" edc:desc="Direction control" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="STOP" edc:desc="Stop counter on event" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="DEC" edc:desc="Decrement counter on event" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="PPW" edc:desc="Period capture value in CC0 register, pulse width capture value in CC1 register" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="PWP" edc:desc="Period capture value in CC1 register, pulse width capture value in CC0 register" edc:when="(field &amp; 0x7) == 6"/>
              <edc:SFRFieldSemantic edc:cname="FAULT" edc:desc="Non-recoverable fault" edc:when="(field &amp; 0x7) == 7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CNTSEL" edc:desc="Timer/counter Output Event Mode" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="START" edc:desc="An interrupt/event is generated when a new counter cycle starts" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="END" edc:desc="An interrupt/event is generated when a counter cycle ends" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="BETWEEN" edc:desc="An interrupt/event is generated when a counter cycle ends, except for the first and last cycles" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="BOUNDARY" edc:desc="An interrupt/event is generated when a new counter cycle starts or a counter cycle ends" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="OVFEO" edc:desc="Overflow/Underflow Output Event Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRGEO" edc:desc="Retrigger Output Event Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNTEO" edc:desc="Timer/counter Output Event Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TCINV0" edc:desc="Inverted Event 0 Input Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCINV1" edc:desc="Inverted Event 1 Input Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCEI0" edc:desc="Timer/counter Event 0 Input Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCEI1" edc:desc="Timer/counter Event 1 Input Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MCEI0" edc:desc="Match or Capture Channel 0 Event Input Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MCEI1" edc:desc="Match or Capture Channel 1 Event Input Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MCEI2" edc:desc="Match or Capture Channel 2 Event Input Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MCEI3" edc:desc="Match or Capture Channel 3 Event Input Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="MCEO0" edc:desc="Match or Capture Channel 0 Event Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MCEO1" edc:desc="Match or Capture Channel 1 Event Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MCEO2" edc:desc="Match or Capture Channel 2 Event Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MCEO3" edc:desc="Match or Capture Channel 3 Event Output Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42002424" edc:access="------------nnnnnnnnnn------nnnn" edc:cname="INTENCLR" edc:impl="0xFFC0F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="TCC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC1">
            <edc:SFRFieldDef edc:cname="OVF" edc:desc="Overflow Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRG" edc:desc="Retrigger Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNT" edc:desc="Counter Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ERR" edc:desc="Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="UFS" edc:desc="Non-Recoverable Update Fault Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DFS" edc:desc="Non-Recoverable Debug Fault Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FAULTA" edc:desc="Recoverable Fault A Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FAULTB" edc:desc="Recoverable Fault B Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FAULT0" edc:desc="Non-Recoverable Fault 0 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FAULT1" edc:desc="Non-Recoverable Fault 1 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MC0" edc:desc="Match or Capture Channel 0 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MC1" edc:desc="Match or Capture Channel 1 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MC2" edc:desc="Match or Capture Channel 2 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MC3" edc:desc="Match or Capture Channel 3 Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42002428" edc:access="------------nnnnnnnnnn------nnnn" edc:cname="INTENSET" edc:impl="0xFFC0F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="TCC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC1">
            <edc:SFRFieldDef edc:cname="OVF" edc:desc="Overflow Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRG" edc:desc="Retrigger Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNT" edc:desc="Counter Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ERR" edc:desc="Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="UFS" edc:desc="Non-Recoverable Update Fault Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DFS" edc:desc="Non-Recoverable Debug Fault Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FAULTA" edc:desc="Recoverable Fault A Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FAULTB" edc:desc="Recoverable Fault B Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FAULT0" edc:desc="Non-Recoverable Fault 0 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FAULT1" edc:desc="Non-Recoverable Fault 1 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MC0" edc:desc="Match or Capture Channel 0 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MC1" edc:desc="Match or Capture Channel 1 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MC2" edc:desc="Match or Capture Channel 2 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MC3" edc:desc="Match or Capture Channel 3 Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4200242C" edc:access="------------nnnnnnnnnn------nnnn" edc:cname="INTFLAG" edc:impl="0xFFC0F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="TCC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC1">
            <edc:SFRFieldDef edc:cname="OVF" edc:desc="Overflow" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRG" edc:desc="Retrigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNT" edc:desc="Counter" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ERR" edc:desc="Error" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="UFS" edc:desc="Non-Recoverable Update Fault" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DFS" edc:desc="Non-Recoverable Debug Fault" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FAULTA" edc:desc="Recoverable Fault A" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FAULTB" edc:desc="Recoverable Fault B" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FAULT0" edc:desc="Non-Recoverable Fault 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FAULT1" edc:desc="Non-Recoverable Fault 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MC0" edc:desc="Match or Capture 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MC1" edc:desc="Match or Capture 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MC2" edc:desc="Match or Capture 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MC3" edc:desc="Match or Capture 3" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42002430" edc:access="----nnnn----nnnnnnnnnnnnnnnnnnnn" edc:cname="STATUS" edc:impl="0xF0FFFFF" edc:mclr="00000000000000000000000000000001" edc:nzwidth="0x20" edc:por="00000000000000000000000000000001" ltx:memberofperipheral="TCC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC1">
            <edc:SFRFieldDef edc:cname="STOP" edc:desc="Stop" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IDX" edc:desc="Ramp" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UFS" edc:desc="Non-Recoverable Update Fault State" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DFS" edc:desc="Non-Recoverable Debug Fault State" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SLAVE" edc:desc="Slave" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PATTBV" edc:desc="Pattern Buffer Valid" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WAVEBV" edc:desc="Wave Buffer Valid" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PERBV" edc:desc="Period Buffer Valid" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FAULTAIN" edc:desc="Recoverable Fault A Input" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FAULTBIN" edc:desc="Recoverable Fault B Input" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FAULT0IN" edc:desc="Non-Recoverable Fault0 Input" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FAULT1IN" edc:desc="Non-Recoverable Fault1 Input" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FAULTA" edc:desc="Recoverable Fault A State" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FAULTB" edc:desc="Recoverable Fault B State" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FAULT0" edc:desc="Non-Recoverable Fault 0 State" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FAULT1" edc:desc="Non-Recoverable Fault 1 State" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCBV0" edc:desc="Compare Channel 0 Buffer Valid" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCBV1" edc:desc="Compare Channel 1 Buffer Valid" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCBV2" edc:desc="Compare Channel 2 Buffer Valid" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCBV3" edc:desc="Compare Channel 3 Buffer Valid" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CMP0" edc:desc="Compare Channel 0 Value" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMP1" edc:desc="Compare Channel 1 Value" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMP2" edc:desc="Compare Channel 2 Value" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMP3" edc:desc="Compare Channel 3 Value" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42002434" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="COUNT" edc:impl="0xFFFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="TCC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC1">
            <edc:SFRFieldDef edc:cname="COUNT" edc:desc="Counter Value" edc:nzwidth="0x18"/>
            <edc:AdjustPoint edc:offset="-20"/>
            <edc:SFRFieldDef edc:cname="COUNT" edc:desc="Counter Value" edc:nzwidth="0x14"/>
            <edc:AdjustPoint edc:offset="-19"/>
            <edc:SFRFieldDef edc:cname="COUNT" edc:desc="Counter Value" edc:nzwidth="0x13"/>
            <edc:AdjustPoint edc:offset="-18"/>
            <edc:SFRFieldDef edc:cname="COUNT" edc:desc="Counter Value" edc:nzwidth="0x12"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42002438" edc:access="nnnnnnnnnnnnnnnn" edc:cname="PATT" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="TCC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC1">
            <edc:SFRFieldDef edc:cname="PGE0" edc:desc="Pattern Generator 0 Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGE1" edc:desc="Pattern Generator 1 Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGE2" edc:desc="Pattern Generator 2 Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGE3" edc:desc="Pattern Generator 3 Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGE4" edc:desc="Pattern Generator 4 Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGE5" edc:desc="Pattern Generator 5 Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGE6" edc:desc="Pattern Generator 6 Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGE7" edc:desc="Pattern Generator 7 Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGV0" edc:desc="Pattern Generator 0 Output Value" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGV1" edc:desc="Pattern Generator 1 Output Value" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGV2" edc:desc="Pattern Generator 2 Output Value" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGV3" edc:desc="Pattern Generator 3 Output Value" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGV4" edc:desc="Pattern Generator 4 Output Value" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGV5" edc:desc="Pattern Generator 5 Output Value" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGV6" edc:desc="Pattern Generator 6 Output Value" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGV7" edc:desc="Pattern Generator 7 Output Value" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4200243A" edc:offset="0x2"/>
      <edc:SFRDef edc:_addr="0x4200243C" edc:access="----nnnn----nnnn----nnnnn-nn-nnn" edc:cname="WAVE" edc:impl="0xF0F0FB7" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="TCC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC1">
            <edc:SFRFieldDef edc:cname="WAVEGEN" edc:desc="Waveform Generation" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="NFRQ" edc:desc="Normal frequency" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="MFRQ" edc:desc="Match frequency" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="NPWM" edc:desc="Normal PWM" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="DSCRITICAL" edc:desc="Dual-slope critical" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="DSBOTTOM" edc:desc="Dual-slope with interrupt/event condition when COUNT reaches ZERO" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="DSBOTH" edc:desc="Dual-slope with interrupt/event condition when COUNT reaches ZERO or TOP" edc:when="(field &amp; 0x7) == 6"/>
              <edc:SFRFieldSemantic edc:cname="DSTOP" edc:desc="Dual-slope with interrupt/event condition when COUNT reaches TOP" edc:when="(field &amp; 0x7) == 7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RAMP" edc:desc="Ramp Mode" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="RAMP1" edc:desc="RAMP1 operation" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="RAMP2A" edc:desc="Alternative RAMP2 operation" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="RAMP2" edc:desc="RAMP2 operation" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="RAMP2C" edc:desc="Critical RAMP2 operation" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CIPEREN" edc:desc="Circular period Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CICCEN0" edc:desc="Circular Channel 0 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CICCEN1" edc:desc="Circular Channel 1 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CICCEN2" edc:desc="Circular Channel 2 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CICCEN3" edc:desc="Circular Channel 3 Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="POL0" edc:desc="Channel 0 Polarity" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="POL1" edc:desc="Channel 1 Polarity" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="POL2" edc:desc="Channel 2 Polarity" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="POL3" edc:desc="Channel 3 Polarity" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="SWAP0" edc:desc="Swap DTI Output Pair 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWAP1" edc:desc="Swap DTI Output Pair 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWAP2" edc:desc="Swap DTI Output Pair 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWAP3" edc:desc="Swap DTI Output Pair 3" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42002440" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PER" edc:impl="0xFFFFFF" edc:mclr="11111111111111111111111111111111" edc:nzwidth="0x20" edc:por="11111111111111111111111111111111" ltx:memberofperipheral="TCC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC1">
            <edc:SFRFieldDef edc:cname="PER" edc:desc="Period Value" edc:nzwidth="0x18"/>
            <edc:AdjustPoint edc:offset="-20"/>
            <edc:SFRFieldDef edc:cname="PER" edc:desc="Period Value" edc:nzwidth="0x14"/>
            <edc:AdjustPoint edc:offset="-19"/>
            <edc:SFRFieldDef edc:cname="PER" edc:desc="Period Value" edc:nzwidth="0x13"/>
            <edc:AdjustPoint edc:offset="-18"/>
            <edc:SFRFieldDef edc:cname="PER" edc:desc="Period Value" edc:nzwidth="0x12"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42002444" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CC0" edc:impl="0xFFFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="TCC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC1">
            <edc:SFRFieldDef edc:cname="CC" edc:desc="Channel Compare/Capture Value" edc:nzwidth="0x18"/>
            <edc:AdjustPoint edc:offset="-20"/>
            <edc:SFRFieldDef edc:cname="CC" edc:desc="Channel Compare/Capture Value" edc:nzwidth="0x14"/>
            <edc:AdjustPoint edc:offset="-19"/>
            <edc:SFRFieldDef edc:cname="CC" edc:desc="Channel Compare/Capture Value" edc:nzwidth="0x13"/>
            <edc:AdjustPoint edc:offset="-18"/>
            <edc:SFRFieldDef edc:cname="CC" edc:desc="Channel Compare/Capture Value" edc:nzwidth="0x12"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
